Tekla Open API Reference for Tekla Structures 2025
ImageComboBox.SelectedIndex Property
 Gets or sets the selected index of the image in the image combo box.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int SelectedIndex { get; set; }
Public Property SelectedIndex As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
ImageComboBox Class
Tekla.Structures.Dialog.UIControls Namespace